In [1]:
import pandas as pd
from sqlalchemy import create_engine

import pymysql

In [9]:
df = pd.read_csv('name.basics.tsv', sep='\t')
df.head()
#| pd.to_numeric(df['deathYear'], errors='coerce') > 2013

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0043044,tt0053137"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0117057,tt0038355,tt0037382,tt0071877"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0049189,tt0057345,tt0059956,tt0054452"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0080455,tt0078723,tt0072562,tt0077975"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050986,tt0050976,tt0069467,tt0083922"

In [11]:
df = df[(~df['deathYear'].str.isnumeric()) | (pd.to_numeric(df['deathYear'], errors='coerce') > 2013)]
df.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0117057,tt0038355,tt0037382,tt0071877"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0049189,tt0057345,tt0059956,tt0054452"
12,nm0000013,Doris Day,1922,2019,"soundtrack,actress,producer","tt0053172,tt0060463,tt0055100,tt0048317"
13,nm0000014,Olivia de Havilland,1916,\N,"actress,soundtrack","tt0029843,tt0040806,tt0041452,tt0031381"
17,nm0000018,Kirk Douglas,1916,2020,"actor,producer,soundtrack","tt0054331,tt0043338,tt0049456,tt0052365"

In [12]:
df.drop(['birthYear', 'deathYear', 'primaryProfession', 'knownForTitles'], axis=1, inplace=True)

In [13]:
df.rename(columns={'nconst': 'actor_id','primaryName': 'name'}, inplace=True)
df.head()

     actor_id                 name
1   nm0000002        Lauren Bacall
2   nm0000003      Brigitte Bardot
12  nm0000013            Doris Day
13  nm0000014  Olivia de Havilland
17  nm0000018         Kirk Douglas

In [14]:
df['actor_id'] = df['actor_id'].replace(to_replace ='nm', value = '', regex = True)
df['actor_id'] = df['actor_id'].astype('int32')
df.head()

In [21]:
tableName   = "Actors"
dataFrame   = df

sqlEngine       = create_engine('mysql+pymysql://root:cinemalocal@127.0.0.1/cinema', pool_recycle=3600)
dbConnection    = sqlEngine.connect()

try:
    frame = dataFrame.to_sql(tableName, dbConnection, if_exists='fail');
except ValueError as vx:
    print(vx)
except Exception as ex:   
    print(ex)
else:
    dbConnection.execute('ALTER TABLE `Actors` ADD PRIMARY KEY (`actor_id`);')
    print("Table %s created successfully."%tableName);   
finally:
    dbConnection.close()

Table Actors created successfully.